# Day 12

# Pandas

pandas main focues for analyse , clean , mutate data.

In [ ]:
# use cases of pandas 
# Data Cleaning
# Data Analysis
# Data transformation
# Data Visualization
# Data Aggregation
# file handling
# Data Filtering and Selection
# Time Series Analysis

# Panda Series

A series is a one-dimensional labeled array capable of holding any data type. The axis labels are collectively called the index.

In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\thean\appdata\roaming\python\python313\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\thean\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import numpy as np
import pandas as pd

In [4]:
labels = ["a","b","c"]
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,3:30}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

# DataFrame

-> When you combine multiple series together

In [ ]:
# Creating a dataframe
data = {
    'Name':["john","Anna","peter","linda"],
    'Age' :[28,34,29,42],
    'city' : ["New York", "Paris", "Berlin", "London"],
    'Salary' : [65000, 7000, 6200, 85000]
}
df = pd.DataFrame(data)

    Name  Age      city  Salary
0   john   28  New York   65000
1   Anna   34     Paris    7000
2  peter   29    Berlin    6200
3  linda   42    London   85000

In [14]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
df2
columns = ["Name", "Age", "City", "Salary"]
df2 = pd.DataFrame(data_list,columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [17]:
# Selection and  Indexing of Columns

df2['Name']
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [19]:
# Creating a new Column
df2["Desi"] = ['dr','en','dr','en']
df2

    Name  Age      City  Salary Desi
0   John   28  New York   65000   dr
1   Anna   34     Paris   70000   en
2  Peter   29    Berlin   62000   dr
3  Linda   42    London   85000   en

In [ ]:
# Removing Columns
df2.drop('Desi',axis = 1) # its only saw copy of the dataframe not original

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [22]:
df2

    Name  Age      City  Salary Desi
0   John   28  New York   65000   dr
1   Anna   34     Paris   70000   en
2  Peter   29    Berlin   62000   dr
3  Linda   42    London   85000   en

In [23]:
df2.drop('Desi',axis = 1, inplace=True) # now its mutate original one

In [24]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [25]:
# Selecting Rows
df2.loc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [26]:
df2.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object